pokerApp/app/controllers/api/v1/newpokers_controller.rb

SELECT "newpokers".* FROM "newpokers"
---
      def index
        newpokers = Newpoker.all